app/Controllers/Pagos.php

    public function guardar() {
        $pagoModel = new PagoModel();

        $pagoModel->save([
            'usuario_id'  => $this->request->getPost('usuario_id'),
            'monto'       => $this->request->getPost('monto'),
            'mes_pagado'  => $this->request->getPost('mes'),
            'anio_pagado' => date('Y'),
            'fecha_pago'  => date('Y-m-d'),
            'metodo_pago' => $this->request->getPost('metodo'),
			'nota'  => $this->request->getPost('nota'),
        ]);
---
INSERT INTO `pagos` (`usuario_id`, `monto`, `mes_pagado`, `anio_pagado`, `fecha_pago`, `metodo_pago`, `nota`) VALUES ('3', '20.00', '2', '2026', '2026-02-22', 'Pago Movil', 'PAGO DEL MES DE FEBRERO')

	public function dashboard() {
	    $db = \Config\Database::connect();
		$meses = ["Enero", "Febrero", "Marzo", "Abril", "Mayo", "Junio",
         "Julio", "Agosto", "Septiembre", "Octubre", "Noviembre", "Diciembre"];
	    $mesActual = $meses[date('n') - 1];

	    $data['totalRecaudado'] = $db->table('pagos')
	                                 ->where('mes_pagado', $mesActual)
	                                 ->selectSum('monto')
	                                 ->get()->getRow()->monto ?? 0;

	    $data['totalClientes'] = $db->table('usuarios')->where('estado', 'activo')->countAllResults();

	    $data['pagosRealizados'] = $db->table('pagos')
	                                  ->where('mes_pagado', $mesActual)
	                                  ->countAllResults();
---
SELECT SUM(`monto`) AS `monto`
FROM `pagos`
WHERE `mes_pagado` = 'Marzo'
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `estado` = 'activo'
SELECT COUNT(*) AS `numrows`
FROM `pagos`
WHERE `mes_pagado` = 'Marzo'

	public function crear() {
	    $db = \Config\Database::connect();
	    // Traemos usuarios con el precio de su plan para el autocompletado JS
	    $data['usuarios'] = $db->table('usuarios u')
	                           ->select('u.id, u.nombres, u.apellidos, p.nombre_plan as plan_nombre, p.precio as precio_plan')
	                           ->join('planes p', 'p.id = u.plan_id')
	                           ->where('u.estado', 'activo')
	                           ->get()->getResultArray();
---
SELECT `u`.`id`, `u`.`nombres`, `p`.`nombre_plan` as `plan_nombre`, `p`.`precio` as `precio_plan`
FROM `usuarios` `u`
JOIN `planes` `p` ON `p`.`id` = `u`.`plan_id`
WHERE `u`.`estado` = 'activo'