app/Controllers/Planes.php

    public function index()
    {
        $model = new PlanModel();
        $data['planes'] = $model->findAll();
---
SELECT *
FROM `planes`