app/Controllers/Productos.php

SELECT *
FROM `productos`
---
    public function index()
    {
        $model = new ProductoModel();
        $data['productos'] = $model->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'
---
    public function editar($id)
    {
        $model = new ProductoModel();
        $data['producto'] = $model->find($id);