app/Controllers/Usuarios.php

    public function index()
    {
        $model = new UsuarioModel();
        $data['clientes'] = $model->findAll();
---
SELECT *
FROM `usuarios`

    public function editar($id)
    {
        $model = new UsuarioModel();
        $producto = new ProductoModel();
        $data = [
                    'cliente'   => $model->find($id),
                    'productos' => $producto->findAll(), // Para llenar el select
        ];
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '2'
SELECT *
FROM `productos`