app/Models/PagoModel.php

SELECT `pagos`.*, `usuarios`.`nombres` as `cliente`
FROM `pagos`
JOIN `usuarios` ON `usuarios`.`id` = `pagos`.`usuario_id`
---
    public function getPagosConUsuarios() {
        return $this->select('pagos.*, usuarios.nombres as nombre_cliente, usuarios.apellidos as apellido_cliente')
                    ->join('usuarios', 'usuarios.id = pagos.usuario_id')
                    ->findAll();